Revit 2027 API
ParameterTypeId.RvtLinkReferenceType Property
 "Reference Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RvtLinkReferenceType { get; }
Public Shared ReadOnly Property RvtLinkReferenceType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RvtLinkReferenceType {
	ForgeTypeId^ get ();
}
static member RvtLinkReferenceType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace